## Production: terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                        |
|--------|----------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.sre_bot_error`   |
|        | `aws_cloudwatch_log_metric_filter.sre_bot_warning` |
|        | `aws_cloudwatch_metric_alarm.sre_bot_error`        |
|        | `aws_cloudwatch_metric_alarm.sre_bot_warning`      |
|        | `aws_cloudwatch_query_definition.api_errors`       |
|        | `aws_cloudwatch_query_definition.api_warnings`     |
|        | `aws_sns_topic.cloudwatch_warning`                 |
|        | `aws_sns_topic_subscription.alert_warning`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.sre_bot_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "sre_bot_error" {
      + id             = (known after apply)
      + log_group_name = "/ecs/sre-bot-app"
      + name           = "SREBotErrorLogged"
      + pattern        = "?ERROR ?Error"

      + metric_transformation {
          + name      = "SREBotErrorLogged"
          + namespace = "SREBot"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.sre_bot_warning will be created
  + resource "aws_cloudwatch_log_metric_filter" "sre_bot_warning" {
      + id             = (known after apply)
      + log_group_name = "/ecs/sre-bot-app"
      + name           = "SREBotWarningLogged"
      + pattern        = "?WARNING ?Warning"

      + metric_transformation {
          + name      = "SREBotWarningLogged"
          + namespace = "SREBot"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.sre_bot_error will be created
  + resource "aws_cloudwatch_metric_alarm" "sre_bot_error" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Errors logged by the SRE Bot"
      + alarm_name                            = "SRE Bot Errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SREBotErrorLogged"
      + namespace                             = "SREBot"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sre_bot_warning will be created
  + resource "aws_cloudwatch_metric_alarm" "sre_bot_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Warnings logged by the SRE Bot"
      + alarm_name                            = "SRE Bot Warnings"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SREBotWarningLogged"
      + namespace                             = "SREBot"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.api_errors will be created
  + resource "aws_cloudwatch_query_definition" "api_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/ecs/sre-bot-app",
        ]
      + name                = "SRE Bot Errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /(?i)ERROR|FAILED/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.api_warnings will be created
  + resource "aws_cloudwatch_query_definition" "api_warnings" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/ecs/sre-bot-app",
        ]
      + name                = "SRE Bot Warnings"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /WARNING/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_sns_topic.cloudwatch_warning will be created
  + resource "aws_sns_topic" "cloudwatch_warning" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sre-bot-cloudwatch-alarms-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "sre-bot"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "sre-bot"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.alert_warning will be created
  + resource "aws_sns_topic_subscription" "alert_warning" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.vpc.aws_eip.nat,
  on .terraform/modules/vpc/vpc/main.tf line 40, in resource "aws_eip" "nat":
  40:   vpc = true

use domain attribute instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre_bot_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sre_bot_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.aws_access_requests_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.sre_bot_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.webhooks_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre-bot_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.sre_bot_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.sre_bot_healthcheck"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_query_log_config.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.sre_bot_load_balancer"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.sre_bot_error"]
WARN - plan.json - main -...
```

</details>
